Revit 2027 API
PhaseArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PhaseArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As PhaseArrayIterator
public:
virtual PhaseArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> PhaseArrayIterator
override ForwardIterator : unit -> PhaseArrayIterator
Return Value
PhaseArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
PhaseArray Class
Autodesk.Revit.DB Namespace